{
  "navbar": {
    "home": "Home",
    "about": "About",
    "services": "Services",
    "contact": "Contact",
    "getStarted": "Get Started"
  },
  "home": {
    "welcome": "Compassionate Therapy for Your Inner Journey",
    "videoNotSupported": "Your browser does not support the video tag.",
    "freeConsultation": "Free Consultation",
    "intro1": "At every stage of life, we face challenges that can leave us feeling disconnected from ourselves. You might feel like you've lost confidence in your ability to cope, or you're struggling to find meaning in what once felt certain.",
    "intro2": "In our work together, I create a safe and welcoming space where your story is fully heard and valued. You hold the deepest wisdom about your life. My role is to walk beside you—holding space, sharing tools, and honoring your journey every step of the way.",
    "intro3": "As a therapist, my priority is to offer compassionate, genuine care—especially when life feels heavy. My approach is eclectic, but I primarily use Internal Family Systems (IFS) as my guiding framework.",
    "intro4": "Deep healing begins when we approach every part of ourselves—the wounded, the angry, the lonely, even the parts we dislike—with curiosity rather than judgment.",
    "learnMore": "Learn More About My Approach",
    "quote": "Healing isn't about 'fixing' yourself—it's about awakening the resilience and wholeness already within you. When you're ready to begin, I'm here."
  },
  "about": {
    "title": "Meet Siya",
    "credential": "Registered Psychotherapist (Qualifying)",
    "education": "Education & Credentials",
    "educationText": "I hold a Master of Science in Psychotherapy from McMaster University and am a Registered Psychotherapist (Qualifying) with the CRPO. With over six years of experience across diverse settings—from crisis helplines to community programs and family health teams—I've learned that real healing emerges when therapy is collaborative, culturally responsive, and grounded in real-world challenges.",
    "experience": "Experience",
    "experienceText": "My 3,000+ hours of counselling experience include supporting adolescents and adults through immediate relief (single-session interventions), focused growth (short-term therapy for specific goals), and deep healing (longer-term work for complex trauma). This work unfolded within organizations like the Canadian Mental Health Association, Hamilton Family Health Team, and Distress Centres of Greater Toronto.",
    "howIWork": "How I Work",
    "howIWorkText": "I specialize in helping you meet wounded, protective, or disliked aspects of yourself with curiosity—especially self-critical parts that whisper 'you're not good enough.' Through Internal Family Systems-informed interventions, we'll gently reconnect you with your calm, compassionate core Self. When we meet our inner world without judgment, we transform suffering at its source—cultivating not just balance, but enduring self-trust.",
    "beyondTherapy": "Beyond Therapy",
    "beyondTherapyText": "Beyond therapy, life with my three cats—especially my serene white companion—teaches daily lessons in boundaries, rest, and radical self-honoring. Their instinctive wisdom mirrors what I hope for you: that prioritizing your needs becomes second nature, not guilt—a foundation for authentic growth.",
    "pullQuote": "The world is not perfect, and we all hold fragments within us—parts shaped by wounds, by sorrow, by moments that left us fractured. Along the 'Way of Self,' I walk beside you as a guiding light, helping these exiled parts find safety, compassion, and finally, home.",
    "heroQuote": "Therapy is not about fixing you—it's about helping you come home to yourself.",
    "heroBgAlt": "Soft abstract background",
    "profileAlt": "Siya, Registered Psychotherapist",
    "portraitAlt": "Portrait of Siya",
    "aboutSiya": "About Siya"
  },
  "services": {
    "title": "Psychotherapy Services",
    "individual": "Individual Psychotherapy",
    "individualDesc": "Individual therapy offers a dedicated space to explore your inner world—thoughts, feelings, and the impact of past experiences—with compassionate guidance. Together, we'll cultivate curiosity and insight in a judgment-free environment where every part of you is valued and embraced.",
    "howWeWork": "How We'll Work",
    "availability": "Availability: ",
    "weekdays": "Weekday Evenings & Early Mornings",
    "weekends": "Weekends (9:00 AM–9:00 PM EST)",
    "consultation": "Free 20-Minute Consultation for New Clients",
    "sessionFee": "Session Fee:",
    "fee": "$160 per 50-Minute Session",
    "insuranceNote": "Sliding scale fees are available for self-paying clients",
    "virtual": "Virtual Sessions • Ontario Residents",
    "group": "Group Psychotherapy",
    "groupDesc": "Curated spaces for shared healing and growth. Join the waitlist for upcoming groups focused on:",
    "group1": "Self-compassion for high-achievers",
    "group2": "Navigating complex relationships",
    "group3": "Trauma resilience",
    "comingSoon": "Coming Soon",
    "individualIconAlt": "Individual therapy icon",
    "groupIconAlt": "Group therapy icon",
    "faq1": {
      "q": "Do you accept insurance?",
      "a": "Yes, we do! Please confirm coverage for psychotherapy with your insurance provider. We can also provide a fee quote with details to help you verify benefits. Common providers include Manulife, Sun Life, GreenShield, Blue Cross, and Telus Health. However, coverage varies by plan."
    },
    "faq2": {
      "q": "Do you offer sliding scale rates?",
      "a": "Yes, we offer reduced fees for clients without insurance, those with limited coverage, and international students. Don’t hesitate to contact us directly to discuss options."
    },
    "faq3": {
      "q": "Do you provide doctor’s notes?",
      "a": "Psychotherapists can provide clinical letters based on your assessment and needs. However, acceptance is determined by your institution (e.g., school or workplace). We recommend clarifying their requirements first. To be noted, most institutions require documentation from a physician, psychologist, psychiatrist, or licensed medical provider."
    },
    "faq4": {
      "q": "How long are sessions, and how often will we meet?",
      "a": "Sessions are typically 50 minutes. Most clients begin with weekly appointments, but we’ll tailor frequency to your needs and adjust as you progress. We’ll discuss what works best for you during our initial consultation."
    },
    "faq5": {
      "q": "Is everything I say confidential?",
      "a": "Yes—with rare exceptions required by law. Your privacy is foundational to our work. We’ll explain confidentiality in detail during our first session, including limits like imminent safety risks, child protection concerns, or court orders. You’re always welcome to ask questions about privacy at any time."
    },
    "faq6": {
      "q": "How do I know if we’re a good fit?",
      "a": "Therapy works best when you feel truly safe, heard, and understood. While building trust takes time, your comfort matters from day one.\n\nTo help you decide, we offer a free 20-minute phone/video consultation. We’ll talk about your hopes for therapy, answer all your questions, and explore whether working together feels right. No pressure, no strings."
    }
  },
  "contact": {
    "title": "Send a Direct Message",
    "heroTitle": "Start Your Therapy Journey Now",
    "heroDesc": "I offer a free 20-minute initial phone consultation to answer your questions and discuss how I might help. Let's connect and take the first step towards your well-being today.",
    "freeConsultation": "Free Consultation",
    "email-title": "Email",
    "phone-title": "Phone",
    "email": "Email (required)",
    "phone": "Phone (required)",
    "name": "Your Name (required)",
    "namePlaceholder": "Enter your name",
    "phonePlaceholder": "e.g, 1234567890",
    "emailPlaceholder": "email@email.com",
    "message": "Message (required)",
    "messagePlaceholder": "For your privacy, please do not share personal health information or mental health concerns through this form.",
    "send": "Send Message",
    "sending": "Sending...",
    "success": "Message sent successfully! I will get back to you soon!",
    "error": "Error sending message. You can contact me via email above.",
    "errorName": "Name is required.",
    "errorEmailRequired": "Email is required.",
    "errorEmailFormat": "Invalid email format.",
    "errorPhoneRequired": "Phone is required.",
    "errorPhoneFormat": "Invalid Canadian phone number.",
    "errorMessage": "Message must be at least 10 characters."
  }
}